sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
#if ( MCAL_NO_OF_CORES == 3U )
#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TRAP_START_SEC_CODE_CPU2_TRAP
#include "MemMap.h"
#else
#define IFX_MCAL_TRAP_START_SEC_CODE_CPU2_TRAP_ASIL_B
#include "Ifx_MemMap.h"
#endif
void cpu2_trap_0 (void);
#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TRAP_STOP_SEC_CODE_CPU2_TRAP
#include "MemMap.h"
#else
#define IFX_MCAL_TRAP_STOP_SEC_CODE_CPU2_TRAP_ASIL_B
#include "Ifx_MemMap.h"
#endif
#endif

#if (IFX_MCAL_USED == STD_ON)
#define MCAL_TRAP_START_SEC_CODE
#include "MemMap.h"
#else
#define IFX_MCAL_TRAP_START_SEC_CODE_ASIL_B
#include "Ifx_MemMap.h"
#endif

void _trap_0( void );
void _trap_1( void );
void _trap_2( void );
void _trap_3( void );
void _trap_4( void );
void _trap_5( void );
void _trap_6( void );
void _trap_7( void );

EcuHwCtrlM_S_EcuHwErrData_t Ecu_Hw_Pflash_EccError = {
	ERR_INHIBIT, /* flag */
	0, /* count */
	PFLASH_ECCERROR_DET_COUNT, /* limit */
};

EcuHwCtrlM_S_EcuHwErrData_t Ecu_Hw_Dflash_EccError = {
	ERR_INHIBIT, /* flag */
	0, /* count */
	DFLASH_ECCERROR_DET_COUNT, /* limit */
};

EcuHwCtrlM_S_EcuHwErrData_t Ecu_Hw_Ram_DSPR_EccError = {
	ERR_INHIBIT, /* flag */
	0, /* count */
	RAM_ECCERROR_DET_COUNT, /* limit */
};

EcuHwCtrlM_S_EcuHwErrData_t Ecu_Hw_Ram_PSPR_EccError = {
	ERR_INHIBIT, /* flag */
	0, /* count */
	RAM_ECCERROR_DET_COUNT, /* limit */
};

void EcuHwCtrlM_Sec_CommonCheck(EcuHwCtrlM_S_EcuHwErrData_t * ErrData, uint8 Check);


/********************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/

/******************************************************************************
** Syntax : void _trap_0( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample Service for  class 0 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 0 handler. */
void _trap_0( void )
{
  uint32 tin;

  __asm ("svlcx");

  __GETTIN (tin);


  TrapIdentification[0][tin] = 1;
  switch(tin)
   {
     case 0:
          // AB print_f("\nClass 0: Virtual Address Fill Trap occurred\n");
          // AB get_char();

          break;

     case 1:
          // AB print_f("\nClass 0: Virtual Address Protection Trap occurred\n");
          // AB get_char();

          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm ("rfe \n");
}
/******************************************************************************
** Syntax : void _trap_1( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 1 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 1 handler. */
void _trap_1( void )
{
  uint32 tin;

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[1][tin] = 1;
  switch(tin)
   {
     case 1:
          // AB print_f("\nClass 1: Privilege Instruction Trap occurred\n");
          // AB get_char();

          break;

     case 2:
          // AB print_f("\nClass 1: Memory Protection Read Trap occurred\n");
          // AB get_char();

          break;

     case 3:
          // AB print_f("\nClass 1: Memory Protection Write Trap occurred\n");
          // AB get_char();

          break;

     case 4:
          // AB print_f("\nClass 1: Memory Protection Execution Trap occurred\n");
          // AB get_char();

          break;

     case 5:
          // AB print_f("\nClass 1: Memory Protection Peripheral Access Trap occurred\n");
          // AB get_char();

          break;

     case 6:
          // AB print_f("\nClass 1: Memory Protection Null Address Trap occurred\n");
          // AB get_char();
          break;

     case 7:
          // AB print_f("\nClass 1: Global Register Write Protection Trap occurred\n");
          // AB get_char();

          break;


     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx\n");
  __asm ("rfe \n");
}
/******************************************************************************
** Syntax : void _trap_2( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 2 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 2 handler. */
void _trap_2( void )
{
  uint32 tin;

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[2][tin] = 1;
  switch(tin)
   {
     case 1:
          // AB print_f("\nClass 2: Illegal Opcode Trap occurred\n");
          // AB get_char();

          break;

