sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
     case 2:
          // AB print_f("\nClass 2: Unimplemented Opcode Trap occurred\n");
          // AB get_char();

          break;

     case 3:
          // AB print_f("\nClass 2: Invalid Operand Specification Trap occurred\n");
          // AB get_char();

          break;

     case 4:
          // AB print_f("\nClass 2: Data Address Alignment Trap occurred\n");
          // AB get_char();

          break;

     case 5:
          // AB print_f("\nClass 2: Invalid Local Memory Address Trap occurred\n");
          // AB get_char();

          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm ("rfe \n");
}
/******************************************************************************
** Syntax : void _trap_3( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 3 trap                            **
**                                                                           **
*****************************************************************************/

/* Trap class 3 handler. */
void _trap_3( void )
{
  /* No local variables used in this function */
  /* No function calls to be performed */
  uint32 tin;

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[3][tin] = 1;

    UVALCON0  = (uint32) SCU_WDTCPU0_CON0.U;
    SCU_WDTCPU0_CON0.U = SCU_WDTCPU0_CON0.U & ~0x00000001 ;

    UVALCON0 |=  0x000000F1;       /*  set HWPW1 = 1111b */
    UVALCON0 &= ~0x00000002;       /*  set WDTLCK = 0 */
    UVALCON0 &= ~0x0000000C;       /*  set HWPW0 = 00b */

    SCU_WDTCPU0_CON0.U =  UVALCON0;          /*  unlock access */

    SCU_WDTCPU0_CON0.U  |=  0x000000F2;      /*  set HWPW1 = 1111b and WDTLCK = 1 */
    SCU_WDTCPU0_CON0.U  &= ~0x0000000C;      /*  set HWPW0 = 00b */
  switch(tin)
  {
     case 1:
         /* Free context list depletion trap */
     case 2:
         /* Call depth overflow trap occurred */

     case 3:
         /* Call depth underflow trap occurred */
     case 4:
         /* Free context list underflow trap */
     case 5:
         /* call stack underflow trap */
     case 6:
         /* context type trap */
     case 7:
         /* Nesting error */
         /* Perform reset */
         SCU_SWRSTCON.B.SWRSTREQ = 1U;
         break;
     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
  }
  __asm ("rslcx \n");
  __asm ("rfe \n");

/* The return statement here intentionally removed because compiler will
   generate SVLCX instruction in the begining of trap3 handler which again
   results in trap3 because there is no free CSA, so the warning generated by
   compiler here should be ignored */
}

/******************************************************************************
** Syntax : void _trap_4( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 4 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 4 handler. */
void _trap_4( void )
{
  uint32 tin;
  static uint8 entry_cnt = 0;

  if (entry_cnt == 0)
  {
	  Ecu_Hw_Ram_PSPR_EccError.flag = ERR_NONE;
	  Ecu_Hw_Ram_DSPR_EccError.flag = ERR_NONE;
	  Ecu_Hw_Pflash_EccError.flag = ERR_NONE;
	  Ecu_Hw_Dflash_EccError.flag = ERR_NONE;
	  entry_cnt = 1;
  }

  __asm ("svlcx\n");

/***********Trap Handler mechanism****************/
    volatile static uint8 trap_cnt = 0;
    uint32 datr_status = 0;
    uint32 dstr_status = 0;
    uint32 pstr_status = 0;
    uint32 pietr_status = 0;
    uint32 dietr_status = 0;
    uint32 error_addr = 0;

  	trap_cnt++;
    pstr_status = __mfcr(CPU_PSTR) ;
    pietr_status = __mfcr(CPU_PIETR);
    datr_status = __mfcr(CPU_DATR) ;
    dstr_status = __mfcr(CPU_DSTR) ;
    dietr_status = __mfcr(CPU_DIETR);

    if ((pstr_status != 0) || (pietr_status != 0) || (datr_status != 0) || (dstr_status != 0) || (dietr_status != 0))
      {
        if (pstr_status != 0)
        {
          //error_addr = (uint32)__getA11();
        }
        else if (pietr_status != 0)
        {
          error_addr = __mfcr(CPU_PIEAR);
        }
        else if ((datr_status != 0) || (dstr_status != 0))
        {
          error_addr = __mfcr(CPU_DEADD);

