sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
         // __mtcr (CPU_DATR, 0x0); /*Need to clear for DAE Trap*/
        }
        else //(dietr_status != 0)
        {
          error_addr = __mfcr(CPU_DIEAR);
        }

        if (((error_addr >= 0x80000000) && (error_addr <= 0x801fffff)) /*|| ((error_addr >= 0xa0000000) && (error_addr <= 0xa03fffff))*/)
        {
            //P-Flash Error
            EcuHwCtrlM_Sec_CommonCheck(&Ecu_Hw_Pflash_EccError, TRUE);
        }
        else if (((error_addr >= 0xaf000000) && (error_addr <= 0xaf103fff)) || ((error_addr >= 0xaf110000) && (error_addr <= 0xaf11ffff)))
        {
            //D-Flash Error
            EcuHwCtrlM_Sec_CommonCheck(&Ecu_Hw_Dflash_EccError, TRUE);
        }
        else if (/*((error_addr >= 0x50000000) && (error_addr <= 0x5001dfff)) || ((error_addr >= 0x60100000) && (error_addr <= 0x60107fff)) ||*/
                        ((error_addr >= 0x70100000) && (error_addr <= 0x70101FFF)))
        {
            //PSPR(Program Scratch Pad RAM) Error
            EcuHwCtrlM_Sec_CommonCheck(&Ecu_Hw_Ram_PSPR_EccError, TRUE);
        }
        else if (/*((error_addr >= 0x50100000) && (error_addr <= 0x50107fff)) || ((error_addr >= 0x60000000) && (error_addr <= 0x6001dfff)) ||*/
                        ((error_addr >= 0x70000000) && (error_addr <= 0x7002DFFF)))
        {
            //DSPR(Data Scract Pad RAM) Error
            EcuHwCtrlM_Sec_CommonCheck(&Ecu_Hw_Ram_DSPR_EccError, TRUE);
        }
        else
        {
            ;
        }
      }
/***********Trap Handler mechanism ends************/

  __GETTIN (tin);
  TrapIdentification[4][tin] = 1;
  switch(tin)
   {
     case 1:
          // AB print_f("\nClass 4: Program Fetch Synchronous Error Trap occurred\n");
          // AB get_char();

          break;

     case 2:
          // AB print_f("\nClass 4: Data Access Synchronous Error Trap occurred\n");
          // AB get_char();

          break;

     case 3:
          // AB print_f("\nClass 4: Data Access Asynchronous Error Trap occurred\n");
          // AB get_char();

          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          //DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm("add.a a11, #4"); // Increase return address
  __asm ("rfe \n");
}


void EcuHwCtrlM_Sec_CommonCheck(EcuHwCtrlM_S_EcuHwErrData_t * ErrData, uint8 Check)
{
    if(ErrData->flag!=ERR_INHIBIT)
    {
        /* Convert Condition Data Type From Uint8 To Boolean */
        if(!!Check)
        {
            /* Increase Check Count When Condition is True. */
            ErrData->count++;
        }

        /* Check Pass/Fail */
        if(ErrData->count>=ErrData->limit)
        {
            ErrData->flag = ERR_FAILED;
            ErrData->count = ErrData->limit;
        }
        else
        {
            ErrData->flag = ERR_PASSED;
        }
    }
}


/******************************************************************************
** Syntax : void _trap_5( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 5 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 5 handler. */
void _trap_5( void )
{
  uint32 tin;

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[5][tin] = 1;
  switch(tin)
   {
     case 1:
          // AB print_f("\nClass 5: Arithemetic Overflow Trap occurred\n");
          // AB get_char();

          break;

     case 2:
          // AB print_f("\nClass 5: Sticky Arithemetic Overflow Trap occurred\n");
          // AB get_char();

          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm ("rfe \n");
}

/******************************************************************************
** Syntax : void _trap_6( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 6 trap                            **
**                                                                           **
*****************************************************************************/

/* *INDENT-OFF* */


/* Trap class 6 handler. */
void _trap_6( void )
{

    uint8 tin;
  __asm ("svlcx");

  __GETTIN (tin);

  /* TIN can be any number between 0 and 255.
   * storing the tin number in
   * TrapIdentification[6][0]
   */
  TrapIdentification[6][0] = tin;
  #if defined IFX_MCAL_TEST_USER_MODE_DEFINE
  #if (IFX_MCAL_TEST_USER_MODE_DEFINE != (0U))

  if ((MCAL_TIN_CALL_RESET_ENDINIT == tin))
  {
    Mcal_ResetENDINIT();
  }
  else if ((MCAL_TIN_CALL_SET_ENDINIT == tin))
  {
    Mcal_SetENDINIT();
  }
  else  if ((MCAL_TIN_CALL_WRITE32 == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR;
    uint32 Value;

    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d5" : "=d"(Value));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d5" : "=d"(Value));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d5,Value);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    *SFR = Value;
  }
  else  if ((MCAL_TIN_CALL_MODIFY32 == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR;
    uint32 SetMask;
    uint32 ClearMask;
    uint32 Value;

    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d5" : "=d"(ClearMask));
      __asm("mov %0,d6" : "=d"(SetMask));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d5" : "=d"(ClearMask));
      __asm__("mov %0,%%d6" : "=d"(SetMask));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d5,ClearMask);
      GET_DATA_REG(d6,SetMask);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    Value = ((*SFR)& (ClearMask));
    *SFR = ((Value)|(SetMask));
  }
  else  if ((MCAL_TIN_CALL_READ32 == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR;

    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    SFR_Return_Value = *SFR;
  }
  else  if ((MCAL_TIN_CALL_SAFETY_RESET_ENDINIT_TIMED == tin))
  {
    uint32 Value;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov %0,d4" : "=d"(Value));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov %0,%%d4" : "=d"(Value));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Value);
    #endif
    #endif
    Mcal_ResetSafetyENDINIT_Timed(Value);
  }
  else  if ((MCAL_TIN_CALL_SAFETY_SET_ENDINIT_TIMED == tin))
  {
    Mcal_SetSafetyENDINIT_Timed();
  }
  else if ((MCAL_TIN_CALL_MCAL_COREID == tin))
  {
    SV_Return_Value = Mcal_GetCoreId();
  }
   else if ((MCAL_CALL_TIN_SET_ATOMIC == tin))
  {
    volatile sint32* address;
    volatile uint32 val;
    volatile sint32 offset;
    volatile uint32 Bits;

#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
      __asm("mov.aa %0,a4" : "=a"(address));
      __asm("mov %0,d4" : "=d"(val));
      __asm("mov %0,d5" : "=d"(offset));
      __asm("mov %0,d6" : "=d"(Bits));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
      __asm("mov.aa %0,%%a4" : "=a"(address));
      __asm("mov %0,%%d4" : "=d"(val));
      __asm("mov %0,%%d5" : "=d"(offset));
      __asm("mov %0,%%d6" : "=d"(Bits));

#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempaddress;
      GET_ADDRESS_REG(a4,tempaddress);
      address= (sint32*)tempaddress;
      GET_DATA_REG(d4,val);
      GET_DATA_REG(d5,offset);
      GET_DATA_REG(d6,Bits);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
  switch(Bits)
   {
     case 1:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 1);
      break;
      
