sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
     case 2:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 2);
      break;      
      
     case 3:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 3);
      break;    

      case 4:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 4);
      break;  
      
     case 8:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 8);
      break;

     case 12:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 12);
      break;      
      
     case 16:
       Mcal_SetAtomic((sint32*)(void*)address, val,offset, 16);
      break; 
      
     default:
     break;
      
   }     
        
  }
  else if(MCAL_CALL_TIN_EXTRACT == tin )
  {
     uint32* Value;
     uint32 Pos;
     uint32 Width;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov.aa %0,a4" : "=a"(Value));
     __asm("mov %0,d4" : "=d"(Pos));
     __asm("mov %0,d5" : "=d"(Width));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov.aa %0,%%a4" : "=a"(Value));
     __asm("mov %0,%%d4" : "=d"(Pos));
     __asm("mov %0,%%d5" : "=d"(Width));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 temvalue;
      GET_ADDRESS_REG(a4,temvalue);
      Value= (uint32*)temvalue;
      GET_DATA_REG(d4,Pos);
      GET_DATA_REG(d5,Width);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    if(Width == 1)
    {
    SV_Return_Value = Mcal_Extract(*Value,Pos,1);
    }
    else if(Width == 2)
    {
    SV_Return_Value = Mcal_Extract(*Value,Pos,2);
    }

  }

  else if(MCAL_CALL_TIN_DMA_RESETCHANNEL == tin)
  {
     uint32 Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Channel);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif

    Mcal_DmaResetDmaChannel((Dma_ChannelType)Channel) ;
  }

  else if(MCAL_CALL_TIN_DMA_CHANNELCLR_INTRFLG == tin)
  {
     uint32 Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Channel);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaChClrIntrFlags((Dma_ChannelType)Channel) ;
  }
  else if (MCAL_CALL_TIN_DMA_GET_TRANSFERINTSTATS == tin)
  {
     Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel= (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    SV_Return_Value = Mcal_DmaGetTransferIntStatus((Dma_ChannelType)Channel) ;

 }

  else if (MCAL_CALL_TIN_DMA_DISABL_HWTRFR == tin)
 {
     uint32 Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaDisableHwTransfer((Dma_ChannelType)Channel);

 }
  else if (MCAL_CALL_TIN_DMA_SETSRC_ADDRS == tin)
 {
     uint32 Channel;
     uint32* Address;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
     __asm("mov.aa %0,a4" : "=a"(Address));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
     __asm("mov.aa %0,%%a4" : "=a"(Address));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempaddress;
      GET_DATA_REG(d4,Channel);
     GET_ADDRESS_REG(a4,tempaddress);
     Address = (uint32*)tempaddress;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaSetSourceAddr((Dma_ChannelType)Channel,(uint32)Address);

 }
   else if (MCAL_CALL_TIN_DMA_SETDST_ADDRS == tin)
 {
     uint32 Channel;
     uint32* Address;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
     __asm("mov.aa %0,a5" : "=a"(Address));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
      __asm("mov.aa %0,%%a5" : "=a"(Address));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempAddress;
      GET_DATA_REG(d4,Channel);
      GET_ADDRESS_REG(a5,tempAddress);
      Address =(uint32*)tempAddress;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
     Mcal_DmaSetDestAddr((Dma_ChannelType)Channel,(uint32)Address);

 }
 else if(MCAL_CALL_TIN_DMA_CHACLR_CTRLFLG == tin)
 {
      uint32 Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Channel);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
     Mcal_DmaChClrCtlCfg((Dma_ChannelType)Channel);

