sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
 }

 else if (MCAL_CALL_TIN_DMA_CFGINT_CTRL == tin)
  {
      uint32 Channel;
     uint32 Value ;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
     __asm("mov %0,d5" : "=d"(Value));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
     __asm("mov %0,%%d5" : "=d"(Value));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Channel);
      GET_DATA_REG(d5,Value);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaCfgIntControl((Dma_ChannelType)Channel, Value) ;
 }

  else if (MCAL_CALL_TIN_DMA_SET_DATAWDTH == tin)
  {
      uint32 Channel;
     uint32 DataWidth ;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
     __asm("mov %0,d5" : "=d"(DataWidth));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
     __asm("mov %0,%%d5" : "=d"(DataWidth));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Channel);
      GET_DATA_REG(d5,DataWidth);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaSetDataWidth((Dma_ChannelType)Channel, DataWidth) ;
 }

 else if (MCAL_CALL_TIN_DMA_SET_TXCOUNT == tin)
 {
      uint32 Channel;
     uint32 ReloadValue ;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
     __asm("mov %0,d5" : "=d"(ReloadValue));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
     __asm("mov %0,%%d5" : "=d"(ReloadValue));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel =(Dma_ChannelType)tempchannel;
      GET_DATA_REG(d5,ReloadValue);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaSetTxCount((Dma_ChannelType)Channel, ReloadValue) ;
 }
 else if (MCAL_CALL_TIN_DMA_ENABLE_CHINT_TRGR == tin)
 {
       Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel= (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaEnableChIntrTrigger(Channel) ;

    }
else if (MCAL_CALL_TIN_DMA_ENABLE_INTR == tin)
 {
      Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));

#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
       Channel = (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaEnableIntr(Channel) ;
 }
 else if (MCAL_CALL_TIN_DMA_ADICR == tin)
 {
       Dma_ChannelType Channel;
     uint32 Value;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
     __asm("mov %0,d5" : "=d"(Value));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
     __asm("mov %0,%%d5" : "=d"(Value));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      GET_DATA_REG(d5,Value);
      Channel = (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaSetAdicr(Channel,Value);
 }
 else if (MCAL_CALL_TIN_ENABLE_HWTRANSFER == tin)
 {
        Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel = (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaEnableHwTransfer(Channel);
 }

 else if (MCAL_CALL_TIN_CLR_ADCR == tin)
 {
        Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaClrAdcr(Channel);
 }

  else if (MCAL_CALL_TIN_DMA_DISABLE_INTR == tin)
 {
        Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaDisableIntr( Channel);
 }

  else if (MCAL_CALL_TIN_DMACHCLR_INTCTETR_FLGS == tin)
 {
        Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaChClrIntctEtrlFlags( Channel);
 }

