sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
 else if (MCAL_CALL_TIN_GET_DSPR_REMAPADDRS == tin)
 {
    Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif           
    SV_Return_Value = Mcal_GetDsprReMapAddress( Channel);

 }

 else if (MCAL_CALL_TIN_DMAGET_TRANSREQLOSTFLG == tin)
 {
    Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    SV_Return_Value = Mcal_DmaGetTransReqLostFlag(Channel);

 }
  else if (MCAL_CALL_TIN_DMA_CLRERRFLG == tin)
 {
    Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaClrErrFlags(Channel);

 }
  else if (MCAL_CALL_TIN_DMA_DISABLE_INTRTRGR == tin)
 {
    Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel)); 
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
	 __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
	  uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel); 
      Channel = (Dma_ChannelType)tempChannel; 
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif		   
	Mcal_DmaDisableChIntrTrigger(Channel);
 }
 else if (MCAL_CALL_TIN_RELEASESPIN_LOCK == tin)
 {
    uint32 *SpinLckPtr;

    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SpinLckPtr));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SpinLckPtr));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempSpinLckPtr;
      GET_ADDRESS_REG(a4,tempSpinLckPtr);
      SpinLckPtr = (uint32*)tempSpinLckPtr;
    #endif
    #endif
    Mcal_ReleaseSpinLock(SpinLckPtr);
 }
  else if (MCAL_CALL_TIN_GETSPIN_LOCK == tin)
 {
    uint32 *SpinLckPtr;
    uint32 Timeout;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SpinLckPtr));
      __asm("mov %0,d4" : "=d"(Timeout));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SpinLckPtr));
      __asm__("mov %0,%%d4" : "=d"(Timeout));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempSpinLckPtr;
      GET_ADDRESS_REG(a4,tempSpinLckPtr);
      SpinLckPtr = (uint32 *)tempSpinLckPtr;
      GET_DATA_REG(d4,Timeout);
    #endif
    #endif
    SV_Return_Value= Mcal_GetSpinLock(SpinLckPtr,Timeout);

 }
  else if (MCAL_CALL_TIN_LOCK_RESOURCE == tin)
 {
    uint32 *SpinLckPtr;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SpinLckPtr));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SpinLckPtr));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
        uint32 tempSpinLckPtr;
      GET_ADDRESS_REG(a4,tempSpinLckPtr);
      SpinLckPtr = (uint32 *)tempSpinLckPtr;
    #endif
    #endif
    Mcal_ReleaseSpinLock(SpinLckPtr);
 }
   else if (MCAL_CALL_TIN_UNLOCK_RESOURCE == tin)
 {
    uint32 *ResourcePtr;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(ResourcePtr));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(ResourcePtr));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 tempResourcePtr;
    GET_ADDRESS_REG(a4,tempResourcePtr);
    ResourcePtr= (uint32 *)tempResourcePtr;
    #endif
    #endif
    Mcal_UnlockResource(ResourcePtr);

 }
    else if (MCAL_CALL_TIN_CPUWDT_PWSQNCE == tin)
 {
     uint32 Password;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Password));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Password));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Password);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_CpuWdtPwSequence(Password);

 }

 else if (MCAL_CALL_TIN_SAFETY_PWSQNCE == tin)
 {
     uint32 Password;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Password));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Password));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,Password);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_SafetyPwSequence(Password);

