sangho007/MCAL_Project/SCU_Gen6/Source/5_Bsw/Mcal/AURIX_MC-ISAR_AS4XX_AURIX_TC23X_AC_V201/irq/Mcal_Trap.c
 }

 else if (MCAL_CALL_TIN_SAFETY_PWSQNCE == tin)
 {
     uint32 CheckPassword;
     uint32 CheckTimer;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(CheckPassword));
     __asm("mov %0,d5" : "=d"(CheckTimer));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(CheckPassword));
      __asm("mov %0,%%d5" : "=d"(CheckTimer));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,CheckPassword);
      GET_DATA_REG(d5,CheckTimer);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_CpuWdtCheckAccess(CheckPassword,CheckTimer);

 }

 else if (MCAL_CALL_TIN_SAFETY_CHECKACCES == tin)
 {
     uint32 CheckPassword;
     uint32 CheckTimer;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(CheckPassword));
      __asm("mov %0,d5" : "=d"(CheckTimer));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(CheckPassword));
      __asm("mov %0,%%d5" : "=d"(CheckTimer));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,CheckPassword);
      GET_DATA_REG(d5,CheckTimer);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_SafetyCheckAccess( CheckPassword, CheckTimer);

 }
 else if (MCAL_CALL_TIN_CPUWDG_MODIFYACCES == tin)
 {
     uint32 NewPassword;
     uint32 NewReload;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(NewPassword));
      __asm("mov %0,d5" : "=d"(NewReload));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(NewPassword));
      __asm("mov %0,%%d5" : "=d"(NewReload));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,NewPassword);
      GET_DATA_REG(d5,NewReload);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_CpuWdtModifyAccess(NewPassword,NewReload);

 }
  else if (MCAL_CALL_TIN_SSPEND_ALLINTRPT == tin)
 {
   SuspendAllInterrupts();
 }

  else if (MCAL_CALL_TIN_RESUME_ALLINTRPT == tin)
 {
    ResumeAllInterrupts();
 }

  else if (MCAL_CALL_TIN_DMACFG_MVPR_TRSFR == tin)
 {
     Dma_ChannelType Channel;
     uint8 NoOfMoves;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
      __asm("mov %0,d5" : "=d"(NoOfMoves));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
      __asm("mov %0,%%d5" : "=d"(NoOfMoves));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempChannel;
      GET_DATA_REG(d4,tempChannel);
      GET_DATA_REG(d5,NoOfMoves);
      Channel = (Dma_ChannelType)tempChannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaCfgNoOfMovesPerTransfer(Channel,NoOfMoves);

 }
 else if (MCAL_CALL_TIN_CALC_SEQ_PSWD == tin)
 {
     uint16 SeqPassword;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(SeqPassword));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(SeqPassword));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,SeqPassword);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    SV_Return_Value =Mcal_WdtCalcSeqPassword(SeqPassword);

 }

 else if (MCAL_CALL_TIN_DMA_START_TRANSCTION == tin)
 {
     Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel = (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    Mcal_DmaStartTransaction(Channel);

 }

 else if (MCAL_CALL_TIN_DMAGET_MOVENGERR_FLGS == tin)
 {
     uint8 MoveEngine;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(MoveEngine));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(MoveEngine));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      GET_DATA_REG(d4,MoveEngine);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    SV_Return_Value = Mcal_DmaGetMoveEngErrFlags(MoveEngine);

 }

else if (MCAL_CALL_TIN_DMAGET_INITSTATUS == tin)
 {
     Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel = (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
    SV_Return_Value = Mcal_DmaGetIntStatus(Channel);

 }

else if (MCAL_CALL_TIN_DMAENTRAS_LOSTINTR == tin)
 {
     Dma_ChannelType Channel;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
     __asm("mov %0,d4" : "=d"(Channel));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
     __asm("mov %0,%%d4" : "=d"(Channel));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempchannel;
      GET_DATA_REG(d4,tempchannel);
      Channel = (Dma_ChannelType)tempchannel;
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
   Mcal_DmaEnTransReqLostIntr(Channel);

